adium
alfred
appcleaner
arq
beamer
charles
chefdk
dropbox
google-chrome
gpgtools
haskell-platform
hipchat
intellij-idea
iterm2
keycastr
lighttable
livereload
mplayerx
onepassword
racket
sizeup
skype
superduper
transmit
utorrent
vagrant
vagrant-manager
virtualbox
