alfred
anaconda2
appcleaner
arq
dropbox
emacs
gpg-suite
java
keybase
postgres
postico
racket
spotify
transmission
zoomus
aptible
mactex
font-iosevka
homebrew/cask-versions/firefox-developer-edition
visualvm
