zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
mafredri/zsh-async
desyncr/auto-ls
leophys/zsh-plugin-fzf-finder
Tarrasch/zsh-command-not-found
sindresorhus/pure
zdharma/fast-syntax-highlighting
zsh-users/zsh-history-substring-search
